[Language]
Main_Title=Thank you for choosing EaseUS Data Recovery Wizard
Sub_Title=How would you rate your overall experience?
Terrible=Terrible
Poor=Poor
Good=Good
Great=Great
Excellent=Excellent
Never_Ask_Again=Never Ask Again
Rate_Now=Rate Now
Feedback_Text_Tips=Please leave your feedback here.
Feedback_Length_Tips=You've entered more than 500 letters.Please email more feedbacks to support@easeus.com.
